ghi-electronics/TinyCLR-Ports/Targets/LPC177x_LPC178x/LPC17_UsbClient.cpp
            if (writeEp != 0 && readEp != 0) {
                break;
            }
        }
        // Check the usbPipe and the two endpoint numbers for validity (both endpoints cannot be zero)
        if ((readEp == USB_NULL_ENDPOINT && writeEp == USB_NULL_ENDPOINT)
            || (readEp != USB_NULL_ENDPOINT && (readEp < 1 || readEp >= LPC17_USB_QUEUE_SIZE))
            || (writeEp != USB_NULL_ENDPOINT && (writeEp < 1 || writeEp >= LPC17_USB_QUEUE_SIZE)))
            return false;

        // The specified endpoints must not be in use by another pipe
        for (int pipe = 0; pipe < LPC17_USB_QUEUE_SIZE; pipe++) {
            if (readEp != USB_NULL_ENDPOINT && (State->pipes[pipe].RxEP == readEp || State->pipes[pipe].TxEP == readEp))
                return false;
            if (writeEp != USB_NULL_ENDPOINT && (State->pipes[pipe].RxEP == writeEp || State->pipes[pipe].TxEP == writeEp))
                return false;
        }

        for (usbPipe = 0; usbPipe < LPC17_USB_QUEUE_SIZE; usbPipe++) {
            // The Pipe must be currently closed
            if (State->pipes[usbPipe].RxEP == USB_NULL_ENDPOINT && State->pipes[usbPipe].TxEP == USB_NULL_ENDPOINT)
                break;
        }

        if (usbPipe == LPC17_USB_QUEUE_SIZE)
            return false; // full endpoint

        // All tests pass, assign the endpoints to the pipe
        State->pipes[usbPipe].RxEP = readEp;
        State->pipes[usbPipe].TxEP = writeEp;

        TinyCLR_UsbClient_ConfigurationDescriptor *config = (TinyCLR_UsbClient_ConfigurationDescriptor *)UsbDefaultConfiguration.config;
        TinyCLR_UsbClient_EndpointDescriptor  *ep = (TinyCLR_UsbClient_EndpointDescriptor  *)(((uint8_t *)config) + USB_CONFIGURATION_DESCRIPTOR_LENGTH + sizeof(TinyCLR_UsbClient_DescriptorHeader) + sizeof(TinyCLR_UsbClient_InterfaceDescriptor));

        uint8_t * end = ((uint8_t *)config) + config->header.size;

        while (((uint8_t *)ep) != nullptr && ((uint8_t *)ep) < end) {
            if (USB_ENDPOINT_DESCRIPTOR_TYPE != ep->bDescriptorType || sizeof(TinyCLR_UsbClient_EndpointDescriptor) != ep->bLength)
                break;

            auto idx = 0;

            if (ep->bEndpointAddress == USB_ENDPOINT_DIRECTION_IN) {
                ep->bEndpointAddress |= writeEp;
                idx = writeEp;
                State->IsTxQueue[idx] = true;
            }

            else if (ep->bEndpointAddress == USB_ENDPOINT_DIRECTION_OUT) {
                ep->bEndpointAddress |= readEp;
                idx = readEp;
                State->IsTxQueue[idx] = false;
            }

            if (idx > 0) {
                if (apiProvider != nullptr) {
                    auto memoryProvider = (const TinyCLR_Memory_Provider*)apiProvider->FindDefault(apiProvider, TinyCLR_Api_Type::MemoryProvider);

                    State->Queues[idx] = (USB_PACKET64*)memoryProvider->Allocate(memoryProvider, LPC17_USB_FIFO_BUFFER_SIZE * sizeof(USB_PACKET64));

                    if (State->Queues[idx] == nullptr)
                        return false;

                    memset(reinterpret_cast<uint8_t*>(State->Queues[idx]), 0x00, LPC17_USB_FIFO_BUFFER_SIZE * sizeof(USB_PACKET64));    
                }

                usb_fifo_buffer_in[idx] = usb_fifo_buffer_out[idx] = usb_fifo_buffer_count[idx] = 0;


                State->MaxPacketSize[idx] = ep->wMaxPacketSize;
            }

            ep = (TinyCLR_UsbClient_EndpointDescriptor  *)(((uint8_t *)ep) + ep->bLength);
        }


        break;
    }

    if (State->CurrentState == USB_DEVICE_STATE_UNINITIALIZED) {
        LPC17_UsbClient_Initialize(controller);
    }
    else if (State->Configured) {
        LPC17_UsbClient_SoftReset(controller);
    }

    State->Configured = true;

    return true;
}

bool UsbClient_Driver::ClosePipe(int controller, int usbPipe) {
    USB_CONTROLLER_STATE * State = &UsbControllerState[controller];

    if (nullptr == State || !State->Initialized || usbPipe >= LPC17_USB_QUEUE_SIZE)
        return false;

    int endpoint;
    DISABLE_INTERRUPTS_SCOPED(irq);

    // Close the Rx pipe
    endpoint = State->pipes[usbPipe].RxEP;
    if (endpoint != USB_NULL_ENDPOINT && State->Queues[endpoint]) {
        usb_fifo_buffer_in[endpoint] = usb_fifo_buffer_out[endpoint] = usb_fifo_buffer_count[endpoint] = 0;
    }

    State->pipes[usbPipe].RxEP = USB_NULL_ENDPOINT;
    //Free endpoint
    LPC17_UsbClient_EndpointMap[endpoint] &= ~ENDPOINT_INUSED_MASK;

    // Close the TX pipe
    endpoint = State->pipes[usbPipe].TxEP;
    if (endpoint != USB_NULL_ENDPOINT && State->Queues[endpoint] != nullptr) {
        usb_fifo_buffer_in[endpoint] = usb_fifo_buffer_out[endpoint] = usb_fifo_buffer_count[endpoint] = 0;

        if (apiProvider != nullptr) {
            auto memoryProvider = (const TinyCLR_Memory_Provider*)apiProvider->FindDefault(apiProvider, TinyCLR_Api_Type::MemoryProvider);

            if (State->Queues[endpoint] != nullptr)
                memoryProvider->Free(memoryProvider, State->Queues[endpoint]);

            State->Queues[endpoint] = nullptr;
        }
    }

    State->pipes[usbPipe].TxEP = USB_NULL_ENDPOINT;

    //Free endpoint
    LPC17_UsbClient_EndpointMap[endpoint] &= ~ENDPOINT_INUSED_MASK;

    configDescriptor.epWrite.bEndpointAddress = USB_ENDPOINT_DIRECTION_IN;
    configDescriptor.epRead.bEndpointAddress = USB_ENDPOINT_DIRECTION_OUT;

    return true;
}

int UsbClient_Driver::Write(int controller, int usbPipe, const char* Data, size_t size) {
    int endpoint;
    int totWrite = 0;
    USB_CONTROLLER_STATE * State = &UsbControllerState[controller];

    if (nullptr == State || usbPipe >= LPC17_USB_QUEUE_SIZE) {
        return -1;
    }

    if (size == 0) return 0;
    if (Data == nullptr) {
        return -1;
    }

    // If the controller is not yet initialized
    if (State->DeviceState != USB_DEVICE_STATE_CONFIGURED) {
        // No data can be sent until the controller is initialized
        return -1;
    }

    endpoint = State->pipes[usbPipe].TxEP;
    // If no Write side to pipe (or if not yet open)
    if (endpoint == USB_NULL_ENDPOINT || State->Queues[endpoint] == nullptr) {
        return -1;
    }
    else {
        DISABLE_INTERRUPTS_SCOPED(irq);

        const char*   ptr = Data;
        uint32_t        count = size;
        bool          Done = false;
        uint32_t        WaitLoopCnt = 0;

        // This loop packetizes the data and sends it out.  All packets sent have
        // the maximum size for the given endpoint except for the last packet which
        // will always have less than the maximum size - even if the packet length
        // must be zero for this to occur.   This is done to comply with standard
        // USB bulk-mode transfers.
        while (!Done) {

            USB_PACKET64* Packet64 = nullptr;
            if (usb_fifo_buffer_count[endpoint] < LPC17_USB_FIFO_BUFFER_SIZE) {
                Packet64 = &State->Queues[endpoint][usb_fifo_buffer_in[endpoint]];

                usb_fifo_buffer_in[endpoint]++;
                usb_fifo_buffer_count[endpoint]++;

                if (usb_fifo_buffer_in[endpoint] == LPC17_USB_FIFO_BUFFER_SIZE)
                    usb_fifo_buffer_in[endpoint] = 0;
            }

            if (Packet64) {
                uint32_t max_move;

