ghi-electronics/TinyCLR-Ports/Targets/LPC177x_LPC178x/LPC17_UsbClient.cpp
/* Command Codes */
#define CMD_SET_ADDR        0x00D00500
#define CMD_CFG_DEV         0x00D80500
#define CMD_SET_MODE        0x00F30500
#define CMD_RD_FRAME        0x00F50500
#define DAT_RD_FRAME        0x00F50200
#define CMD_RD_TEST         0x00FD0500
#define DAT_RD_TEST         0x00FD0200
#define CMD_SET_DEV_STAT    0x00FE0500
#define CMD_GET_DEV_STAT    0x00FE0500
#define DAT_GET_DEV_STAT    0x00FE0200
#define CMD_GET_ERR_CODE    0x00FF0500
#define DAT_GET_ERR_CODE    0x00FF0200
#define CMD_RD_ERR_STAT     0x00FB0500
#define DAT_RD_ERR_STAT     0x00FB0200
#define DAT_WR_BYTE(x)     (0x00000100 | ((x) << 16))
#define CMD_SEL_EP(x)      (0x00000500 | ((x) << 16))
#define DAT_SEL_EP(x)      (0x00000200 | ((x) << 16))
#define CMD_SEL_EP_CLRI(x) (0x00400500 | ((x) << 16))
#define DAT_SEL_EP_CLRI(x) (0x00400200 | ((x) << 16))
#define CMD_SET_EP_STAT(x) (0x00400500 | ((x) << 16))
#define CMD_CLR_BUF         0x00F20500
#define DAT_CLR_BUF         0x00F20200
#define CMD_VALID_BUF       0x00FA0500

/* Device Address Register Definitions */
#define DEV_ADDR_MASK       0x7F
#define DEV_EN              0x80

/* Device Configure Register Definitions */
#define CONF_DVICE          0x01

/* Device Mode Register Definitions */
#define AP_CLK              0x01
#define INAK_CI             0x02
#define INAK_CO             0x04
#define INAK_II             0x08
#define INAK_IO             0x10
#define INAK_BI             0x20
#define INAK_BO             0x40

/* Device Status Register Definitions */
#define DEV_CON             0x01
#define DEV_CON_CH          0x02
#define DEV_SUS             0x04
#define DEV_SUS_CH          0x08
#define DEV_RST             0x10

/* Error Code Register Definitions */
#define ERR_EC_MASK         0x0F
#define ERR_EA              0x10

/* Error Status Register Definitions */
#define ERR_PID             0x01
#define ERR_UEPKT           0x02
#define ERR_DCRC            0x04
#define ERR_TIMOUT          0x08
#define ERR_EOP             0x10
#define ERR_B_OVRN          0x20
#define ERR_BTSTF           0x40
#define ERR_TGL             0x80

/* Endpoint Select Register Definitions */
#define EP_SEL_F            0x01
#define EP_SEL_ST           0x02
#define EP_SEL_STP          0x04
#define EP_SEL_PO           0x08
#define EP_SEL_EPN          0x10
#define EP_SEL_B_1_FULL     0x20
#define EP_SEL_B_2_FULL     0x40

/* Endpoint Status Register Definitions */
#define EP_STAT_ST          0x01
#define EP_STAT_DA          0x20
#define EP_STAT_RF_MO       0x40
#define EP_STAT_CND_ST      0x80

/* Clear Buffer Register Definitions */
#define CLR_BUF_PO          0x01


/* DMA Interrupt Bit Definitions */
#define EOT_INT             0x01
#define NDD_REQ_INT         0x02
#define SYS_ERR_INT         0x04

// LPC178 usbdef.h

#define USB_BASE 0x2008C000

#define OTGIntSt (*(volatile uint32_t *)0x2008C100)
#define OTGIntSt_OFFSET 0x100
#define OTGIntSt_TMR_MASK 0x1
#define OTGIntSt_TMR 0x1
#define OTGIntSt_TMR_BIT 0
#define OTGIntSt_REMOVE_PU_MASK 0x2
#define OTGIntSt_REMOVE_PU 0x2
#define OTGIntSt_REMOVE_PU_BIT 1
#define OTGIntSt_HNP_FAILURE_MASK 0x4
#define OTGIntSt_HNP_FAILURE 0x4
#define OTGIntSt_HNP_FAILURE_BIT 2
#define OTGIntSt_HNP_SUCCESS_MASK 0x8
#define OTGIntSt_HNP_SUCCESS 0x8
#define OTGIntSt_HNP_SUCCESS_BIT 3

#define OTGIntEn (*(volatile uint32_t *)0x2008C104)
#define OTGIntEn_OFFSET 0x104
#define OTGIntEn_TMR_MASK 0x1
#define OTGIntEn_TMR 0x1
#define OTGIntEn_TMR_BIT 0
#define OTGIntEn_REMOVE_PU_MASK 0x2
#define OTGIntEn_REMOVE_PU 0x2
#define OTGIntEn_REMOVE_PU_BIT 1
#define OTGIntEn_HNP_FAILURE_MASK 0x4
#define OTGIntEn_HNP_FAILURE 0x4
#define OTGIntEn_HNP_FAILURE_BIT 2
#define OTGIntEn_HNP_SUCCESS_MASK 0x8
#define OTGIntEn_HNP_SUCCESS 0x8
#define OTGIntEn_HNP_SUCCESS_BIT 3

#define OTGIntSet (*(volatile uint32_t *)0x2008C108)
#define OTGIntSet_OFFSET 0x108
#define OTGIntSet_TMR_MASK 0x1
#define OTGIntSet_TMR 0x1
#define OTGIntSet_TMR_BIT 0
#define OTGIntSet_REMOVE_PU_MASK 0x2
#define OTGIntSet_REMOVE_PU 0x2
#define OTGIntSet_REMOVE_PU_BIT 1
#define OTGIntSet_HNP_FAILURE_MASK 0x4
#define OTGIntSet_HNP_FAILURE 0x4
#define OTGIntSet_HNP_FAILURE_BIT 2
#define OTGIntSet_HNP_SUCCESS_MASK 0x8
#define OTGIntSet_HNP_SUCCESS 0x8
#define OTGIntSet_HNP_SUCCESS_BIT 3

#define OTGIntClr (*(volatile uint32_t *)0x2008C10C)
#define OTGIntClr_OFFSET 0x10C
#define OTGIntClr_TMR_MASK 0x1
#define OTGIntClr_TMR 0x1
#define OTGIntClr_TMR_BIT 0
#define OTGIntClr_REMOVE_PU_MASK 0x2
#define OTGIntClr_REMOVE_PU 0x2
#define OTGIntClr_REMOVE_PU_BIT 1
#define OTGIntClr_HNP_FAILURE_MASK 0x4
#define OTGIntClr_HNP_FAILURE 0x4
#define OTGIntClr_HNP_FAILURE_BIT 2
#define OTGIntClr_HNP_SUCCESS_MASK 0x8
#define OTGIntClr_HNP_SUCCESS 0x8
#define OTGIntClr_HNP_SUCCESS_BIT 3

#define OTGStCtrl (*(volatile uint32_t *)0x2008C110)
#define OTGStCtrl_OFFSET 0x110
#define OTGStCtrl_PORT_FUNC_MASK 0x3
#define OTGStCtrl_PORT_FUNC_BIT 0
#define OTGStCtrl_TMR_SCALE_MASK 0xC
#define OTGStCtrl_TMR_SCALE_BIT 2
#define OTGStCtrl_TMR_MODE_MASK 0x10
#define OTGStCtrl_TMR_MODE 0x10
#define OTGStCtrl_TMR_MODE_BIT 4
#define OTGStCtrl_TMR_EN_MASK 0x20
#define OTGStCtrl_TMR_EN 0x20
#define OTGStCtrl_TMR_EN_BIT 5
#define OTGStCtrl_TMR_RST_MASK 0x40
#define OTGStCtrl_TMR_RST 0x40
#define OTGStCtrl_TMR_RST_BIT 6
#define OTGStCtrl_B_HNP_TRACK_MASK 0x100
#define OTGStCtrl_B_HNP_TRACK 0x100
#define OTGStCtrl_B_HNP_TRACK_BIT 8
#define OTGStCtrl_A_HNP_TRACK_MASK 0x200
#define OTGStCtrl_A_HNP_TRACK 0x200
#define OTGStCtrl_A_HNP_TRACK_BIT 9
#define OTGStCtrl_PU_REMOVED_MASK 0x400
#define OTGStCtrl_PU_REMOVED 0x400
#define OTGStCtrl_PU_REMOVED_BIT 10
#define OTGStCtrl_TMR_CNT_MASK 0xFFFF0000
#define OTGStCtrl_TMR_CNT_BIT 16

#define OTGTmr (*(volatile uint32_t *)0x2008C114)
#define OTGTmr_OFFSET 0x114
#define OTGTmr_TIMEOUT_CNT_MASK 0xFFFF
#define OTGTmr_TIMEOUT_CNT_BIT 0

#define USBPortSel (*(volatile uint32_t *)0x2008C110)
#define USBPortSel_OFFSET 0x110

#define USBDevIntSt (*(volatile uint32_t *)0x2008C200)
#define USBDevIntSt_OFFSET 0x200
#define USBDevIntSt_FRAME_MASK 0x1
#define USBDevIntSt_FRAME 0x1
#define USBDevIntSt_FRAME_BIT 0
#define USBDevIntSt_EP_FAST_MASK 0x2
#define USBDevIntSt_EP_FAST 0x2
#define USBDevIntSt_EP_FAST_BIT 1
#define USBDevIntSt_EP_SLOW_MASK 0x4
#define USBDevIntSt_EP_SLOW 0x4
#define USBDevIntSt_EP_SLOW_BIT 2
#define USBDevIntSt_DEV_STAT_MASK 0x8
#define USBDevIntSt_DEV_STAT 0x8
#define USBDevIntSt_DEV_STAT_BIT 3
#define USBDevIntSt_CCEMTY_MASK 0x10
#define USBDevIntSt_CCEMTY 0x10
#define USBDevIntSt_CCEMTY_BIT 4
#define USBDevIntSt_CDFULL_MASK 0x20
#define USBDevIntSt_CDFULL 0x20
#define USBDevIntSt_CDFULL_BIT 5
#define USBDevIntSt_RxENDPKT_MASK 0x40
#define USBDevIntSt_RxENDPKT 0x40
#define USBDevIntSt_RxENDPKT_BIT 6
#define USBDevIntSt_TxENDPKT_MASK 0x80
#define USBDevIntSt_TxENDPKT 0x80
#define USBDevIntSt_TxENDPKT_BIT 7
#define USBDevIntSt_EP_RLZED_MASK 0x100
#define USBDevIntSt_EP_RLZED 0x100
#define USBDevIntSt_EP_RLZED_BIT 8
#define USBDevIntSt_ERR_INT_MASK 0x200
#define USBDevIntSt_ERR_INT 0x200
#define USBDevIntSt_ERR_INT_BIT 9

