ghi-electronics/TinyCLR-Ports/Targets/LPC177x_LPC178x/LPC17_UsbClient.cpp
        }
    }
}

void LPC17xx_USB_Driver::Global_ISR(void* Param) {
    // we had a weird behavior without this here when disconnectin/connecting USB cable
    DISABLE_INTERRUPTS_SCOPED(irq);
    int32_t disr, val, n, m;

    disr = USBDevIntSt;                      /* Device Interrupt Status */
    USBDevIntClr = disr;                       /* A known issue on LPC214x */

    if (disr & DEV_STAT_INT) {
        //DeviceInterruptCount++;

        WrCmd(CMD_GET_DEV_STAT);
        val = RdCmdDat(DAT_GET_DEV_STAT);       /* Device Status */

        if (val & DEV_RST)                     /* Reset */
        {
            ResetEvent();
        }

        if (val & DEV_SUS_CH)                  /* Suspend/Resume */
        {
            if (val & DEV_SUS)                   /* Suspend */
            {
                SuspendEvent();
            }
            else                               /* Resume */
            {
                ResumeEvent();
            }
        }

        goto isr_end;
    }

    /* Endpoint's Slow Interrupt */
    if (disr & EP_SLOW_INT) {

        //while (USBEpIntSt)                   /* Endpoint Interrupt Status */
        {
            for (n = 0; n < USB_EP_NUM; n++)     /* Check All Endpoints */
            {
                if ((USBEpIntSt & (1 << n)))//&& (USBEpIntEn & (1 << n)) )//only if enabled
                {
                    m = n >> 1;


                    if (m == 0)//EP0
                    {
                        USBEpIntClr = 1 << n;
                        while ((USBDevIntSt & CDFULL_INT) == 0);
                        val = USBCmdData;

                        if (val & EP_SEL_STP)        /* Setup Packet */
                        {
                            ProcessEP0(0, 1);// out setup
                            continue;
                        }
                        if ((n & 1) == 0)                /* OUT Endpoint */
                        {
                            ProcessEP0(0, 0);// out not setup
                        }
                        else {
                            ProcessEP0(1, 0);// in not setup
                        }

                        continue;
                    }
                    if ((n & 1) == 0)                /* OUT Endpoint */
                    {
                        ProcessEndPoint(m, 0);//out
                        //USBC_EPEvent(m, true);
                    }
                    else                           /* IN Endpoint */
                    {
                        ProcessEndPoint(m, 1);//in
                        //USBC_EPEvent(m, false);
                    }
                }
            }
        }
    }

isr_end:
    return;
}


void LPC17xx_USB_Driver::EP0_ISR(uint32_t Param) {
    while (1);//this is not used?????????
}
void LPC17xx_USB_Driver::ProcessEP0(int in, int setup) {
    uint32_t EP_INTR;
    int i;

    DISABLE_INTERRUPTS_SCOPED(irq);

    // set up packet receive
    if (setup)//(EP_INTR & LPC17xx_USB::UDCICR__PCKT) && (USB.UDCCSRx[0] & LPC17xx_USB::UDCCSR__OPC))
    {
        USB_CONTROLLER_STATE *State = g_LPC17xx_USB_Driver.pUsbControllerState;

        uint8_t   len = 0;//USB.UDCBCRx[0] & LPC17xx_USB::UDCBCR_mask;        // Received packet length

        len = USB_ReadEP(0x00, g_LPC17xx_USB_Driver.ControlPacketBuffer);

        // special handling for the very first SETUP command - Getdescriptor[DeviceType], the host looks for 8 bytes data only
        USB_SETUP_PACKET* Setup = (USB_SETUP_PACKET*)&g_LPC17xx_USB_Driver.ControlPacketBuffer[0];
        if ((Setup->bRequest == USB_GET_DESCRIPTOR) && (((Setup->wValue & 0xFF00) >> 8) == USB_DEVICE_DESCRIPTOR_TYPE) && (Setup->wLength != 0x12))
            g_LPC17xx_USB_Driver.FirstDescriptorPacket = true;
        else
            g_LPC17xx_USB_Driver.FirstDescriptorPacket = false;

        // send it to the upper layer
        State->Data = &g_LPC17xx_USB_Driver.ControlPacketBuffer[0];
        State->DataSize = len;

        uint8_t result = LPC17_UsbClient_ControlCallback(State);

        switch (result) {
        case USB_STATE_DATA:
            // setup packet was handled and the upper layer has data to send
            break;

        case USB_STATE_ADDRESS:
            // upper layer needs us to change the address
            // address stage handles in hardware
            USB_DeviceAddress = State->Address | 0x80;
            break;

        case USB_STATE_DONE:
            State->DataCallback = nullptr;
            break;

        case USB_STATE_STALL:
            // since the setup command all handled in the hardware, should not have this state
            //
            // setup packet failed to process successfully
            // set stall condition on the default control
            // endpoint
            //
            USB_SetStallEP(0, 0);
            USB_SetStallEP(0, 1);
            break;

        case USB_STATE_STATUS:
            // handle by hardware
            break;
        case USB_STATE_CONFIGURATION:
            // handle partly by hardware and the GLOBAL_ISR will take care.
            // USB spec 9.4.5 SET_CONFIGURATION resets halt conditions, resets toggle bits

            //int USB_Configure( int Controller, const USB_DYNAMIC_CONFIGURATION *config )////////////////////////////////////////////////////////////////////////////////////////////
            USB_HW_Configure(true);

            // enable all endpoints // ignore EP0
            for (i = 1; i < 16; i++) {
                // direction in
                USB_ConfigEP(i, 1, 64);
                USB_EnableEP(i, 1);
                USB_ResetEP(i, 1);

                // direction out
                USB_ConfigEP(i, 0, 64);
                USB_EnableEP(i, 0);
                USB_ResetEP(i, 0);
            }

            break;

        case USB_STATE_REMOTE_WAKEUP:
            // It is not using currently as the device side won't go into SUSPEND mode unless
            // the PC is purposely to select it to SUSPEND, as there is always SOF in the bus
            // to keeping the device from SUSPEND.
            break;

        default:

            break;
            // the status change is only seen and taken care in hardware
        }
        if (result != USB_STATE_STALL) {
            ControlNext();

